#•	Първи ред – Цена за килограм зеленчуци – реално число[0.00… 1000.00]
#•	Втори ред – Цена за килограм плодове – реално число[0.00… 1000.00]
#•	Трети ред – Общо килограми на зеленчуците – цяло число[0… 1000]
#•	Четвърти ред – Общо килограми на плодовете – цяло число[0… 1000]
#Да се отпечата на конзолата едно число: приходите от всички плодове и зеленчуци в евро.
#Резултата да се форматира до втория знак след десетичния разделител.

price_perkg_veg = float(input())
price_perkg_fru = float(input())
kg_veg = int(input())
kg_fru = int(input())

veg = price_perkg_veg * kg_veg / 1.94
fru = price_perkg_fru * kg_fru / 1.94

att_all = veg + fru

print(f'{att_all:.2f}')
